*** sererr-proto/src/lib.rs:100:9: replace <impl From<sererr::ExceptionMechanism> for ProtoExceptionMechanism>::from -> Self with Default::default()

*** mutation diff:
--- sererr-proto/src/lib.rs
+++ replace <impl From<sererr::ExceptionMechanism> for ProtoExceptionMechanism>::from -> Self with Default::default()
@@ -92,28 +92,17 @@
             source_link: f.source_link,
             in_app: f.in_app,
         }
     }
 }
 
 impl From<sererr::ExceptionMechanism> for ProtoExceptionMechanism {
     fn from(m: sererr::ExceptionMechanism) -> Self {
-        ProtoExceptionMechanism {
-            r#type: m.r#type,
-            description: m.description,
-            handled: m.handled,
-            synthetic: m.synthetic,
-            help_link: m.help_link,
-            source: m.source,
-            exception_id: m.exception_id,
-            parent_id: m.parent_id,
-            is_exception_group: m.is_exception_group,
-            data: m.data,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<sererr::CapturedError> for ProtoCapturedError {
     fn from(e: sererr::CapturedError) -> Self {
         ProtoCapturedError {
             r#type: e.r#type,
             message: e.message,

---- captured_error_with_nested_messages_roundtrips stdout ----

thread 'captured_error_with_nested_messages_roundtrips' (3601985) panicked at sererr-proto/tests/conversion_test.rs:121:5:
assertion `left == right` failed

---- mechanism_roundtrips_with_data_map stdout ----

thread 'mechanism_roundtrips_with_data_map' (3601989) panicked at sererr-proto/tests/conversion_test.rs:87:5:
assertion `left == right` failed
  left: ExceptionMechanism { type: "", description: "", handled: false, synthetic: false, help_link: "", source: "", exception_id: 0, parent_id: 0, is_exception_group: false, data: {} }
 right: ExceptionMechanism { type: "signal", description: "segfault during writes", handled: true, synthetic: false, help_link: "https://example/help", source: "panic_hook", exception_id: 0, parent_id: 0, is_exception_group: false, data: {"errno": "11", "signal": "SIGSEGV"} }

failures:
    captured_error_with_nested_messages_roundtrips
    mechanism_roundtrips_with_data_map

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
