*** sererr-proto/src/lib.rs:117:9: replace <impl From<sererr::CapturedError> for ProtoCapturedError>::from -> Self with Default::default()

*** mutation diff:
--- sererr-proto/src/lib.rs
+++ replace <impl From<sererr::CapturedError> for ProtoCapturedError>::from -> Self with Default::default()
@@ -109,24 +109,17 @@
             is_exception_group: m.is_exception_group,
             data: m.data,
         }
     }
 }
 
 impl From<sererr::CapturedError> for ProtoCapturedError {
     fn from(e: sererr::CapturedError) -> Self {
-        ProtoCapturedError {
-            r#type: e.r#type,
-            message: e.message,
-            frames: e.frames.into_iter().map(Into::into).collect(),
-            mechanism: e.mechanism.map(Into::into),
-            release: e.release,
-            server_name: e.server_name,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<sererr::DebugInfo> for ProtoDebugInfo {
     fn from(di: sererr::DebugInfo) -> Self {
         ProtoDebugInfo {
             stack_entries: di.stack_entries,
             detail: di.detail,

---- captured_error_without_mechanism_roundtrips_as_none stdout ----

thread 'captured_error_without_mechanism_roundtrips_as_none' (3602185) panicked at sererr-proto/tests/conversion_test.rs:144:5:
assertion `left == right` failed
  left: CapturedError { type: "", message: "", frames: [], mechanism: None, release: "", server_name: "" }
 right: CapturedError { type: "MyError", message: "oops", frames: [], mechanism: None, release: "", server_name: "" }

---- captured_error_with_nested_messages_roundtrips stdout ----

thread 'captured_error_with_nested_messages_roundtrips' (3602184) panicked at sererr-proto/tests/conversion_test.rs:121:5:
assertion `left == right` failed
  left: CapturedError { type: "", message: "", frames: [], mechanism: None, release: "", server_name: "" }

failures:
    captured_error_with_nested_messages_roundtrips
    captured_error_without_mechanism_roundtrips_as_none

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
