*** sererr-proto/src/lib.rs:130:9: replace <impl From<sererr::DebugInfo> for ProtoDebugInfo>::from -> Self with Default::default()

*** mutation diff:
--- sererr-proto/src/lib.rs
+++ replace <impl From<sererr::DebugInfo> for ProtoDebugInfo>::from -> Self with Default::default()
@@ -122,20 +122,17 @@
             release: e.release,
             server_name: e.server_name,
         }
     }
 }
 
 impl From<sererr::DebugInfo> for ProtoDebugInfo {
     fn from(di: sererr::DebugInfo) -> Self {
-        ProtoDebugInfo {
-            stack_entries: di.stack_entries,
-            detail: di.detail,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------- proto → plain ----------
 
 impl From<ProtoStackFrame> for sererr::StackFrame {
     fn from(f: ProtoStackFrame) -> Self {
         sererr::StackFrame {

---- debug_info_roundtrips_through_proto stdout ----

thread 'debug_info_roundtrips_through_proto' (3602375) panicked at sererr-proto/tests/conversion_test.rs:163:5:
assertion `left == right` failed
  left: DebugInfo { stack_entries: [], detail: "" }
 right: DebugInfo { stack_entries: ["  at f (src/x.rs:1)", "  at g (src/x.rs:2)"], detail: "MyError: oops" }

failures:
    debug_info_roundtrips_through_proto

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
