*** sererr-proto/src/lib.rs:189:9: replace <impl From<ProtoDebugInfo> for sererr::DebugInfo>::from -> Self with Default::default()

*** mutation diff:
--- sererr-proto/src/lib.rs
+++ replace <impl From<ProtoDebugInfo> for sererr::DebugInfo>::from -> Self with Default::default()
@@ -181,14 +181,11 @@
             release: e.release,
             server_name: e.server_name,
         }
     }
 }
 
 impl From<ProtoDebugInfo> for sererr::DebugInfo {
     fn from(di: ProtoDebugInfo) -> Self {
-        sererr::DebugInfo {
-            stack_entries: di.stack_entries,
-            detail: di.detail,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

---- debug_info_roundtrips_through_proto stdout ----

thread 'debug_info_roundtrips_through_proto' (3603896) panicked at sererr-proto/tests/conversion_test.rs:163:5:
assertion `left == right` failed
  left: DebugInfo { stack_entries: [], detail: "" }
 right: DebugInfo { stack_entries: ["  at f (src/x.rs:1)", "  at g (src/x.rs:2)"], detail: "MyError: oops" }

failures:
    debug_info_roundtrips_through_proto

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
