*** sererr-proto/src/lib.rs:82:9: replace <impl From<sererr::StackFrame> for ProtoStackFrame>::from -> Self with Default::default()

*** mutation diff:
--- sererr-proto/src/lib.rs
+++ replace <impl From<sererr::StackFrame> for ProtoStackFrame>::from -> Self with Default::default()
@@ -74,29 +74,17 @@
     CapturedError as ProtoCapturedError, ExceptionMechanism as ProtoExceptionMechanism,
     StackFrame as ProtoStackFrame,
 };
 
 // ---------- plain → proto ----------
 
 impl From<sererr::StackFrame> for ProtoStackFrame {
     fn from(f: sererr::StackFrame) -> Self {
-        ProtoStackFrame {
-            function: f.function,
-            module: f.module,
-            package: f.package,
-            file: f.file,
-            abs_path: f.abs_path,
-            line: f.line,
-            context_line: f.context_line,
-            pre_context: f.pre_context,
-            post_context: f.post_context,
-            source_link: f.source_link,
-            in_app: f.in_app,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<sererr::ExceptionMechanism> for ProtoExceptionMechanism {
     fn from(m: sererr::ExceptionMechanism) -> Self {
         ProtoExceptionMechanism {
             r#type: m.r#type,
             description: m.description,

---- captured_error_with_nested_messages_roundtrips stdout ----

thread 'captured_error_with_nested_messages_roundtrips' (3601601) panicked at sererr-proto/tests/conversion_test.rs:121:5:
assertion `left == right` failed

---- stack_frame_roundtrips_through_proto stdout ----

thread 'stack_frame_roundtrips_through_proto' (3601606) panicked at sererr-proto/tests/conversion_test.rs:42:5:
assertion `left == right` failed
  left: StackFrame { function: "", module: "", package: "", file: "", abs_path: "", line: 0, context_line: "", pre_context: [], post_context: [], source_link: "", in_app: false }
 right: StackFrame { function: "f", module: "m", package: "pkg", file: "src/x.rs", abs_path: "/build/src/x.rs", line: 42, context_line: "    do_it();", pre_context: ["fn f() {"], post_context: ["}"], source_link: "https://example/source/x.rs#L42", in_app: true }

failures:
    captured_error_with_nested_messages_roundtrips
    stack_frame_roundtrips_through_proto

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
