*** sererr/src/lib.rs:157:19: replace == with != in populate_source_context

*** mutation diff:
--- sererr/src/lib.rs
+++ replace == with != in populate_source_context
@@ -149,17 +149,17 @@
 ///
 /// No-op when the provider returns `None`, when the frame's `line` is
 /// 0 (unknown), or when the file content is shorter than `frame.line`.
 pub fn populate_source_context<P: SourceProvider>(
     frame: &mut StackFrame,
     provider: &P,
     surrounding: usize,
 ) {
-    if frame.line == 0 {
+    if frame.line != /* ~ changed by cargo-mutants ~ */ 0 {
         return;
     }
     let Some(source) = provider.get_source(&frame.file) else {
         return;
     };
     let lines: Vec<&str> = source.lines().collect();
     let idx = (frame.line as usize).saturating_sub(1);
     if idx >= lines.len() {

---- context_clamps_at_file_boundaries stdout ----

thread 'context_clamps_at_file_boundaries' (3590643) panicked at sererr/tests/source_provider_test.rs:140:5:
assertion `left == right` failed
  left: ""
 right: "fn one() {"

---- line_zero_is_a_noop stdout ----

thread 'line_zero_is_a_noop' (3590645) panicked at sererr/tests/source_provider_test.rs:95:5:
assertion failed: frame.context_line.is_empty()

---- populates_context_around_line stdout ----

thread 'populates_context_around_line' (3590647) panicked at sererr/tests/source_provider_test.rs:51:5:
assertion `left == right` failed
  left: ""
 right: "    let x = 2;"

failures:
    context_clamps_at_file_boundaries
    line_zero_is_a_noop
    populates_context_around_line

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
