*** sererr/src/lib.rs:157:5: replace populate_source_context with ()

*** mutation diff:
--- sererr/src/lib.rs
+++ replace populate_source_context with ()
@@ -149,32 +149,17 @@
 ///
 /// No-op when the provider returns `None`, when the frame's `line` is
 /// 0 (unknown), or when the file content is shorter than `frame.line`.
 pub fn populate_source_context<P: SourceProvider>(
     frame: &mut StackFrame,
     provider: &P,
     surrounding: usize,
 ) {
-    if frame.line == 0 {
-        return;
-    }
-    let Some(source) = provider.get_source(&frame.file) else {
-        return;
-    };
-    let lines: Vec<&str> = source.lines().collect();
-    let idx = (frame.line as usize).saturating_sub(1);
-    if idx >= lines.len() {
-        return;
-    }
-    frame.context_line = lines[idx].to_string();
-    let start = idx.saturating_sub(surrounding);
-    frame.pre_context = lines[start..idx].iter().map(|s| s.to_string()).collect();
-    let end = (idx + 1 + surrounding).min(lines.len());
-    frame.post_context = lines[idx + 1..end].iter().map(|s| s.to_string()).collect();
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Adapter shape for the gRPC error model (`google.rpc.DebugInfo`).
 ///
 /// Plain Rust struct, wire-compatible with `google.rpc.DebugInfo`. Use
 /// [`to_debug_info`] to render a capture into this shape. The
 /// `sererr-proto` crate provides a `From<DebugInfo> for
 /// google_rpc::DebugInfo` conversion when you need the actual proto

---- context_clamps_at_file_boundaries stdout ----

thread 'context_clamps_at_file_boundaries' (3590227) panicked at sererr/tests/source_provider_test.rs:140:5:
assertion `left == right` failed
  left: ""
 right: "fn one() {"

---- populates_context_around_line stdout ----

thread 'populates_context_around_line' (3590231) panicked at sererr/tests/source_provider_test.rs:51:5:
assertion `left == right` failed
  left: ""
 right: "    let x = 2;"

failures:
    context_clamps_at_file_boundaries
    populates_context_around_line

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
