*** sererr/src/lib.rs:165:12: replace >= with < in populate_source_context

*** mutation diff:
--- sererr/src/lib.rs
+++ replace >= with < in populate_source_context
@@ -157,17 +157,17 @@
     if frame.line == 0 {
         return;
     }
     let Some(source) = provider.get_source(&frame.file) else {
         return;
     };
     let lines: Vec<&str> = source.lines().collect();
     let idx = (frame.line as usize).saturating_sub(1);
-    if idx >= lines.len() {
+    if idx < /* ~ changed by cargo-mutants ~ */ lines.len() {
         return;
     }
     frame.context_line = lines[idx].to_string();
     let start = idx.saturating_sub(surrounding);
     frame.pre_context = lines[start..idx].iter().map(|s| s.to_string()).collect();
     let end = (idx + 1 + surrounding).min(lines.len());
     frame.post_context = lines[idx + 1..end].iter().map(|s| s.to_string()).collect();
 }

---- context_clamps_at_file_boundaries stdout ----

thread 'context_clamps_at_file_boundaries' (3591103) panicked at sererr/tests/source_provider_test.rs:140:5:
assertion `left == right` failed
  left: ""
 right: "fn one() {"

---- line_past_eof_is_a_noop stdout ----

thread 'line_past_eof_is_a_noop' (3591104) panicked at sererr/src/lib.rs:168:31:
index out of bounds: the len is 13 but the index is 999998

---- populates_context_around_line stdout ----

thread 'populates_context_around_line' (3591107) panicked at sererr/tests/source_provider_test.rs:51:5:
assertion `left == right` failed
  left: ""
 right: "    let x = 2;"

failures:
    context_clamps_at_file_boundaries
    line_past_eof_is_a_noop
    populates_context_around_line

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
