*** sererr/src/lib.rs:171:20: replace + with - in populate_source_context

*** mutation diff:
--- sererr/src/lib.rs
+++ replace + with - in populate_source_context
@@ -163,17 +163,17 @@
     let lines: Vec<&str> = source.lines().collect();
     let idx = (frame.line as usize).saturating_sub(1);
     if idx >= lines.len() {
         return;
     }
     frame.context_line = lines[idx].to_string();
     let start = idx.saturating_sub(surrounding);
     frame.pre_context = lines[start..idx].iter().map(|s| s.to_string()).collect();
-    let end = (idx + 1 + surrounding).min(lines.len());
+    let end = (idx - /* ~ changed by cargo-mutants ~ */ 1 + surrounding).min(lines.len());
     frame.post_context = lines[idx + 1..end].iter().map(|s| s.to_string()).collect();
 }
 
 /// Adapter shape for the gRPC error model (`google.rpc.DebugInfo`).
 ///
 /// Plain Rust struct, wire-compatible with `google.rpc.DebugInfo`. Use
 /// [`to_debug_info`] to render a capture into this shape. The
 /// `sererr-proto` crate provides a `From<DebugInfo> for

---- context_clamps_at_file_boundaries stdout ----

thread 'context_clamps_at_file_boundaries' (3592258) panicked at sererr/src/lib.rs:171:16:
attempt to subtract with overflow

---- populates_context_around_line stdout ----

thread 'populates_context_around_line' (3592262) panicked at sererr/tests/source_provider_test.rs:53:5:
assertion `left == right` failed
  left: []
 right: ["    return x;", "}"]

failures:
    context_clamps_at_file_boundaries
    populates_context_around_line

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
