*** sererr/src/lib.rs:172:36: replace + with - in populate_source_context

*** mutation diff:
--- sererr/src/lib.rs
+++ replace + with - in populate_source_context
@@ -164,17 +164,17 @@
     let idx = (frame.line as usize).saturating_sub(1);
     if idx >= lines.len() {
         return;
     }
     frame.context_line = lines[idx].to_string();
     let start = idx.saturating_sub(surrounding);
     frame.pre_context = lines[start..idx].iter().map(|s| s.to_string()).collect();
     let end = (idx + 1 + surrounding).min(lines.len());
-    frame.post_context = lines[idx + 1..end].iter().map(|s| s.to_string()).collect();
+    frame.post_context = lines[idx - /* ~ changed by cargo-mutants ~ */ 1..end].iter().map(|s| s.to_string()).collect();
 }
 
 /// Adapter shape for the gRPC error model (`google.rpc.DebugInfo`).
 ///
 /// Plain Rust struct, wire-compatible with `google.rpc.DebugInfo`. Use
 /// [`to_debug_info`] to render a capture into this shape. The
 /// `sererr-proto` crate provides a `From<DebugInfo> for
 /// google_rpc::DebugInfo` conversion when you need the actual proto

---- context_clamps_at_file_boundaries stdout ----

thread 'context_clamps_at_file_boundaries' (3593051) panicked at sererr/src/lib.rs:172:32:
attempt to subtract with overflow

---- populates_context_around_line stdout ----

thread 'populates_context_around_line' (3593055) panicked at sererr/tests/source_provider_test.rs:53:5:
assertion `left == right` failed
  left: ["fn two() {", "    let x = 2;", "    return x;", "}"]
 right: ["    return x;", "}"]

failures:
    context_clamps_at_file_boundaries
    populates_context_around_line

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
