*** sererr/src/lib.rs:207:5: replace capture -> Vec<CapturedError> with vec![Default::default()]

*** mutation diff:
--- sererr/src/lib.rs
+++ replace capture -> Vec<CapturedError> with vec![Default::default()]
@@ -199,45 +199,17 @@
 /// runtime type of a `&dyn Error` — producers supply it at the catch
 /// site.
 pub fn capture(
     err: &(dyn Error + 'static),
     type_name: &str,
     release: &str,
     server_name: &str,
 ) -> Vec<CapturedError> {
-    let frames = capture_frames();
-
-    let mut chain: Vec<CapturedError> = Vec::new();
-    let mut current: Option<&(dyn Error + 'static)> = Some(err);
-    let mut leaf_type = type_name.to_string();
-    while let Some(e) = current {
-        chain.push(CapturedError {
-            r#type: std::mem::take(&mut leaf_type),
-            message: format!("{e}"),
-            frames: frames.clone(),
-            mechanism: Some(ExceptionMechanism {
-                r#type: "generic".to_string(),
-                handled: true,
-                ..Default::default()
-            }),
-            release: release.to_string(),
-            server_name: server_name.to_string(),
-        });
-        current = e.source();
-    }
-    chain.reverse();
-
-    for (i, entry) in chain.iter_mut().enumerate() {
-        if let Some(m) = entry.mechanism.as_mut() {
-            m.exception_id = i as u32;
-            m.parent_id = if i == 0 { 0 } else { (i - 1) as u32 };
-        }
-    }
-    chain
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Capture frames from the calling stack.
 ///
 /// Frames are returned most-recent-call-first. Runtime / framework
 /// frames are marked `in_app = false` via a prefix heuristic.
 pub fn capture_frames() -> Vec<StackFrame> {
     let bt = backtrace::Backtrace::new();

---- captured_frames_have_file stdout ----

thread 'captured_frames_have_file' (3594117) panicked at sererr/tests/capture_test.rs:227:5:
expected at least one frame with a file path

---- captured_frames_have_function stdout ----

thread 'captured_frames_have_function' (3594118) panicked at sererr/tests/capture_test.rs:216:5:
expected at least one frame with a function name

---- captured_frames_mark_user_code_in_app stdout ----

thread 'captured_frames_mark_user_code_in_app' (3594120) panicked at sererr/tests/capture_test.rs:251:5:
expected at least one frame to be in_app=true; got []

failures:
    captured_frames_have_file
    captured_frames_have_function
    captured_frames_have_line
    captured_frames_mark_user_code_in_app
    chain_walks_source_most_causal_first
    default_mechanism_is_generic_handled
    frames_are_populated_most_recent_first
    mechanism_ids_stamped_correctly
    single_error_produces_one_entry
    to_debug_info_flattens_chain
    to_debug_info_outermost_has_no_caused_by_prefix

test result: FAILED. 10 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
