*** sererr/src/lib.rs:218:17: delete field r#type from struct ExceptionMechanism expression in capture

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field r#type from struct ExceptionMechanism expression in capture
@@ -210,17 +210,17 @@
     let mut current: Option<&(dyn Error + 'static)> = Some(err);
     let mut leaf_type = type_name.to_string();
     while let Some(e) = current {
         chain.push(CapturedError {
             r#type: std::mem::take(&mut leaf_type),
             message: format!("{e}"),
             frames: frames.clone(),
             mechanism: Some(ExceptionMechanism {
-                r#type: "generic".to_string(),
+                 /* ~ changed by cargo-mutants ~ */
                 handled: true,
                 ..Default::default()
             }),
             release: release.to_string(),
             server_name: server_name.to_string(),
         });
         current = e.source();
     }

---- default_mechanism_is_generic_handled stdout ----

thread 'default_mechanism_is_generic_handled' (3594625) panicked at sererr/tests/capture_test.rs:127:5:
assertion `left == right` failed
  left: ""
 right: "generic"

failures:
    default_mechanism_is_generic_handled

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
