*** sererr/src/lib.rs:219:17: delete field handled from struct ExceptionMechanism expression in capture

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field handled from struct ExceptionMechanism expression in capture
@@ -211,17 +211,17 @@
     let mut leaf_type = type_name.to_string();
     while let Some(e) = current {
         chain.push(CapturedError {
             r#type: std::mem::take(&mut leaf_type),
             message: format!("{e}"),
             frames: frames.clone(),
             mechanism: Some(ExceptionMechanism {
                 r#type: "generic".to_string(),
-                handled: true,
+                 /* ~ changed by cargo-mutants ~ */
                 ..Default::default()
             }),
             release: release.to_string(),
             server_name: server_name.to_string(),
         });
         current = e.source();
     }
     chain.reverse();

---- default_mechanism_is_generic_handled stdout ----

thread 'default_mechanism_is_generic_handled' (3595048) panicked at sererr/tests/capture_test.rs:128:5:
assertion failed: mech.handled

failures:
    default_mechanism_is_generic_handled

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
