*** sererr/src/lib.rs:232:32: replace == with != in capture

*** mutation diff:
--- sererr/src/lib.rs
+++ replace == with != in capture
@@ -224,17 +224,17 @@
         });
         current = e.source();
     }
     chain.reverse();
 
     for (i, entry) in chain.iter_mut().enumerate() {
         if let Some(m) = entry.mechanism.as_mut() {
             m.exception_id = i as u32;
-            m.parent_id = if i == 0 { 0 } else { (i - 1) as u32 };
+            m.parent_id = if i != /* ~ changed by cargo-mutants ~ */ 0 { 0 } else { (i - 1) as u32 };
         }
     }
     chain
 }
 
 /// Capture frames from the calling stack.
 ///
 /// Frames are returned most-recent-call-first. Runtime / framework

---- captured_frames_have_function stdout ----

thread 'captured_frames_have_function' (3595413) panicked at sererr/src/lib.rs:232:85:
attempt to subtract with overflow

---- to_debug_info_single_entry_has_no_caused_by stdout ----

thread 'to_debug_info_single_entry_has_no_caused_by' (3595432) panicked at sererr/src/lib.rs:232:85:
attempt to subtract with overflow

---- default_mechanism_is_generic_handled stdout ----

thread 'default_mechanism_is_generic_handled' (3595417) panicked at sererr/src/lib.rs:232:85:
attempt to subtract with overflow

failures:
    captured_frames_have_file
    captured_frames_have_function
    captured_frames_have_line
    captured_frames_mark_user_code_in_app
    chain_walks_source_most_causal_first
    default_mechanism_is_generic_handled
    empty_release_and_server_are_stored
    frames_are_populated_most_recent_first
    mechanism_ids_stamped_correctly
    single_error_produces_one_entry
    to_debug_info_flattens_chain
    to_debug_info_outermost_has_no_caused_by_prefix

test result: FAILED. 8 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
