*** sererr/src/lib.rs:232:53: replace - with + in capture

*** mutation diff:
--- sererr/src/lib.rs
+++ replace - with + in capture
@@ -224,17 +224,17 @@
         });
         current = e.source();
     }
     chain.reverse();
 
     for (i, entry) in chain.iter_mut().enumerate() {
         if let Some(m) = entry.mechanism.as_mut() {
             m.exception_id = i as u32;
-            m.parent_id = if i == 0 { 0 } else { (i - 1) as u32 };
+            m.parent_id = if i == 0 { 0 } else { (i + /* ~ changed by cargo-mutants ~ */ 1) as u32 };
         }
     }
     chain
 }
 
 /// Capture frames from the calling stack.
 ///
 /// Frames are returned most-recent-call-first. Runtime / framework

---- mechanism_ids_stamped_correctly stdout ----

thread 'mechanism_ids_stamped_correctly' (3595766) panicked at sererr/tests/capture_test.rs:109:5:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    mechanism_ids_stamped_correctly

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
