*** sererr/src/lib.rs:243:5: replace capture_frames -> Vec<StackFrame> with vec![Default::default()]

*** mutation diff:
--- sererr/src/lib.rs
+++ replace capture_frames -> Vec<StackFrame> with vec![Default::default()]
@@ -235,39 +235,17 @@
     chain
 }
 
 /// Capture frames from the calling stack.
 ///
 /// Frames are returned most-recent-call-first. Runtime / framework
 /// frames are marked `in_app = false` via a prefix heuristic.
 pub fn capture_frames() -> Vec<StackFrame> {
-    let bt = backtrace::Backtrace::new();
-
-    let mut out: Vec<StackFrame> = Vec::new();
-    for frame in bt.frames() {
-        for symbol in frame.symbols() {
-            let function = symbol.name().map(|n| n.to_string()).unwrap_or_default();
-            let file = symbol
-                .filename()
-                .map(|p| p.display().to_string())
-                .unwrap_or_default();
-            let line = symbol.lineno().unwrap_or(0);
-            let in_app = is_app_frame(&function);
-
-            out.push(StackFrame {
-                function,
-                file,
-                line,
-                in_app,
-                ..Default::default()
-            });
-        }
-    }
-    out
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Default `in_app` heuristic. Producers with a better signal should
 /// not rely on this.
 pub fn is_app_frame(function: &str) -> bool {
     const NON_APP_PREFIXES: &[&str] = &[
         "std::",
         "core::",

---- captured_frames_have_file stdout ----

thread 'captured_frames_have_file' (3596945) panicked at sererr/tests/capture_test.rs:227:5:
expected at least one frame with a file path

---- captured_frames_have_function stdout ----

thread 'captured_frames_have_function' (3596946) panicked at sererr/tests/capture_test.rs:216:5:
expected at least one frame with a function name

---- captured_frames_have_line stdout ----

thread 'captured_frames_have_line' (3596947) panicked at sererr/tests/capture_test.rs:237:5:
expected at least one frame with line > 0

failures:
    captured_frames_have_file
    captured_frames_have_function
    captured_frames_have_line
    captured_frames_mark_user_code_in_app

test result: FAILED. 17 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
