*** sererr/src/lib.rs:257:17: delete field function from struct StackFrame expression in capture_frames

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field function from struct StackFrame expression in capture_frames
@@ -249,17 +249,17 @@
             let file = symbol
                 .filename()
                 .map(|p| p.display().to_string())
                 .unwrap_or_default();
             let line = symbol.lineno().unwrap_or(0);
             let in_app = is_app_frame(&function);
 
             out.push(StackFrame {
-                function,
+                 /* ~ changed by cargo-mutants ~ */
                 file,
                 line,
                 in_app,
                 ..Default::default()
             });
         }
     }
     out

---- captured_frames_have_function stdout ----

thread 'captured_frames_have_function' (3597237) panicked at sererr/tests/capture_test.rs:216:5:
expected at least one frame with a function name

failures:
    captured_frames_have_function

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
