*** sererr/src/lib.rs:258:17: delete field file from struct StackFrame expression in capture_frames

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field file from struct StackFrame expression in capture_frames
@@ -250,17 +250,17 @@
                 .filename()
                 .map(|p| p.display().to_string())
                 .unwrap_or_default();
             let line = symbol.lineno().unwrap_or(0);
             let in_app = is_app_frame(&function);
 
             out.push(StackFrame {
                 function,
-                file,
+                 /* ~ changed by cargo-mutants ~ */
                 line,
                 in_app,
                 ..Default::default()
             });
         }
     }
     out
 }

---- captured_frames_have_file stdout ----

thread 'captured_frames_have_file' (3597509) panicked at sererr/tests/capture_test.rs:227:5:
expected at least one frame with a file path

failures:
    captured_frames_have_file

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
