*** sererr/src/lib.rs:259:17: delete field line from struct StackFrame expression in capture_frames

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field line from struct StackFrame expression in capture_frames
@@ -251,17 +251,17 @@
                 .map(|p| p.display().to_string())
                 .unwrap_or_default();
             let line = symbol.lineno().unwrap_or(0);
             let in_app = is_app_frame(&function);
 
             out.push(StackFrame {
                 function,
                 file,
-                line,
+                 /* ~ changed by cargo-mutants ~ */
                 in_app,
                 ..Default::default()
             });
         }
     }
     out
 }

---- captured_frames_have_line stdout ----

thread 'captured_frames_have_line' (3597800) panicked at sererr/tests/capture_test.rs:237:5:
expected at least one frame with line > 0

failures:
    captured_frames_have_line

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
