*** sererr/src/lib.rs:260:17: delete field in_app from struct StackFrame expression in capture_frames

*** mutation diff:
--- sererr/src/lib.rs
+++ delete field in_app from struct StackFrame expression in capture_frames
@@ -252,17 +252,17 @@
                 .unwrap_or_default();
             let line = symbol.lineno().unwrap_or(0);
             let in_app = is_app_frame(&function);
 
             out.push(StackFrame {
                 function,
                 file,
                 line,
-                in_app,
+                 /* ~ changed by cargo-mutants ~ */
                 ..Default::default()
             });
         }
     }
     out
 }
 
 /// Default `in_app` heuristic. Producers with a better signal should

---- captured_frames_mark_user_code_in_app stdout ----

thread 'captured_frames_mark_user_code_in_app' (3598081) panicked at sererr/tests/capture_test.rs:251:5:

failures:
    captured_frames_mark_user_code_in_app

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
