*** sererr/src/lib.rs:271:5: replace is_app_frame -> bool with true

*** mutation diff:
--- sererr/src/lib.rs
+++ replace is_app_frame -> bool with true
@@ -263,33 +263,17 @@
         }
     }
     out
 }
 
 /// Default `in_app` heuristic. Producers with a better signal should
 /// not rely on this.
 pub fn is_app_frame(function: &str) -> bool {
-    const NON_APP_PREFIXES: &[&str] = &[
-        "std::",
-        "core::",
-        "alloc::",
-        "<core::",
-        "<std::",
-        "<alloc::",
-        "<unknown>",
-        "rustc_",
-        "__rust_",
-        "_start",
-        "main",
-        "tokio::",
-        "backtrace::",
-        "sererr::",
-    ];
-    !NON_APP_PREFIXES.iter().any(|p| function.starts_with(p))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Adapt a sererr capture into the [`DebugInfo`] shape.
 ///
 /// `stack_entries` gets one line per frame, formatted as
 /// `"  at <function> (<file>:<line>)"`, most-recent-call-first within
 /// each chain entry, separated by `"Caused by: <type>: <message>"`
 /// lines across the chain.

---- is_app_frame_classifies_runtime_libs_as_not_in_app stdout ----

thread 'is_app_frame_classifies_runtime_libs_as_not_in_app' (3598372) panicked at sererr/tests/capture_test.rs:283:5:
assertion failed: !sererr::is_app_frame("tokio::runtime::context::enter")

---- is_app_frame_classifies_stdlib_as_not_in_app stdout ----

thread 'is_app_frame_classifies_stdlib_as_not_in_app' (3598374) panicked at sererr/tests/capture_test.rs:275:5:
assertion failed: !sererr::is_app_frame("std::panicking::panic")

failures:
    is_app_frame_classifies_runtime_libs_as_not_in_app
    is_app_frame_classifies_stdlib_as_not_in_app

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
