*** sererr/src/lib.rs:271:5: replace is_app_frame -> bool with false

*** mutation diff:
--- sererr/src/lib.rs
+++ replace is_app_frame -> bool with false
@@ -263,33 +263,17 @@
         }
     }
     out
 }
 
 /// Default `in_app` heuristic. Producers with a better signal should
 /// not rely on this.
 pub fn is_app_frame(function: &str) -> bool {
-    const NON_APP_PREFIXES: &[&str] = &[
-        "std::",
-        "core::",
-        "alloc::",
-        "<core::",
-        "<std::",
-        "<alloc::",
-        "<unknown>",
-        "rustc_",
-        "__rust_",
-        "_start",
-        "main",
-        "tokio::",
-        "backtrace::",
-        "sererr::",
-    ];
-    !NON_APP_PREFIXES.iter().any(|p| function.starts_with(p))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Adapt a sererr capture into the [`DebugInfo`] shape.
 ///
 /// `stack_entries` gets one line per frame, formatted as
 /// `"  at <function> (<file>:<line>)"`, most-recent-call-first within
 /// each chain entry, separated by `"Caused by: <type>: <message>"`
 /// lines across the chain.

---- is_app_frame_classifies_user_code_as_in_app stdout ----

thread 'is_app_frame_classifies_user_code_as_in_app' (3598679) panicked at sererr/tests/capture_test.rs:268:5:
assertion failed: sererr::is_app_frame("my_crate::handler")

---- captured_frames_mark_user_code_in_app stdout ----

thread 'captured_frames_mark_user_code_in_app' (3598668) panicked at sererr/tests/capture_test.rs:251:5:

failures:
    captured_frames_mark_user_code_in_app
    is_app_frame_classifies_user_code_as_in_app

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
