*** sererr/src/lib.rs:287:5: delete ! in is_app_frame

*** mutation diff:
--- sererr/src/lib.rs
+++ delete ! in is_app_frame
@@ -279,17 +279,17 @@
         "rustc_",
         "__rust_",
         "_start",
         "main",
         "tokio::",
         "backtrace::",
         "sererr::",
     ];
-    !NON_APP_PREFIXES.iter().any(|p| function.starts_with(p))
+     /* ~ changed by cargo-mutants ~ */NON_APP_PREFIXES.iter().any(|p| function.starts_with(p))
 }
 
 /// Adapt a sererr capture into the [`DebugInfo`] shape.
 ///
 /// `stack_entries` gets one line per frame, formatted as
 /// `"  at <function> (<file>:<line>)"`, most-recent-call-first within
 /// each chain entry, separated by `"Caused by: <type>: <message>"`
 /// lines across the chain.

---- is_app_frame_classifies_runtime_libs_as_not_in_app stdout ----

thread 'is_app_frame_classifies_runtime_libs_as_not_in_app' (3598976) panicked at sererr/tests/capture_test.rs:283:5:
assertion failed: !sererr::is_app_frame("tokio::runtime::context::enter")

---- is_app_frame_classifies_stdlib_as_not_in_app stdout ----

thread 'is_app_frame_classifies_stdlib_as_not_in_app' (3598977) panicked at sererr/tests/capture_test.rs:275:5:
assertion failed: !sererr::is_app_frame("std::panicking::panic")

---- is_app_frame_classifies_user_code_as_in_app stdout ----

thread 'is_app_frame_classifies_user_code_as_in_app' (3598978) panicked at sererr/tests/capture_test.rs:268:5:
assertion failed: sererr::is_app_frame("my_crate::handler")

failures:
    is_app_frame_classifies_runtime_libs_as_not_in_app
    is_app_frame_classifies_stdlib_as_not_in_app
    is_app_frame_classifies_user_code_as_in_app

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
