*** sererr/src/lib.rs:300:5: replace to_debug_info -> DebugInfo with Default::default()

*** mutation diff:
--- sererr/src/lib.rs
+++ replace to_debug_info -> DebugInfo with Default::default()
@@ -292,46 +292,17 @@
 /// `stack_entries` gets one line per frame, formatted as
 /// `"  at <function> (<file>:<line>)"`, most-recent-call-first within
 /// each chain entry, separated by `"Caused by: <type>: <message>"`
 /// lines across the chain.
 ///
 /// `detail` joins `"<type>: <message>"` across the chain with
 /// `"\nCaused by: "` separators.
 pub fn to_debug_info(chain: &[CapturedError]) -> DebugInfo {
-    if chain.is_empty() {
-        return DebugInfo::default();
-    }
-
-    let mut stack_entries: Vec<String> = Vec::new();
-    let mut detail_parts: Vec<String> = Vec::new();
-
-    for (idx, entry) in chain.iter().rev().enumerate() {
-        let header = format!("{}: {}", entry.r#type, entry.message);
-        detail_parts.push(if idx == 0 {
-            header.clone()
-        } else {
-            format!("Caused by: {header}")
-        });
-
-        if idx == 0 {
-            stack_entries.push(header);
-        } else {
-            stack_entries.push(format!("Caused by: {header}"));
-        }
-
-        for frame in &entry.frames {
-            stack_entries.push(format_frame_line(frame));
-        }
-    }
-
-    DebugInfo {
-        stack_entries,
-        detail: detail_parts.join("\n"),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn format_frame_line(frame: &StackFrame) -> String {
     let location = if frame.file.is_empty() {
         String::new()
     } else if frame.line > 0 {
         format!(" ({}:{})", frame.file, frame.line)
     } else {

---- frame_with_file_and_line_renders_with_parens_and_colon stdout ----

thread 'frame_with_file_and_line_renders_with_parens_and_colon' (3599256) panicked at sererr/tests/capture_test.rs:360:5:
expected '  at fn_a (src/x.rs:42)' in stack_entries; got []

---- frame_with_file_but_no_line_renders_without_colon stdout ----

thread 'frame_with_file_but_no_line_renders_without_colon' (3599257) panicked at sererr/tests/capture_test.rs:383:5:
expected '  at fn_b (src/y.rs)' (no line); got []

---- frame_with_no_file_renders_bare stdout ----

thread 'frame_with_no_file_renders_bare' (3599258) panicked at sererr/tests/capture_test.rs:407:5:
expected '  at fn_c' (no parens); got []

failures:
    frame_with_file_and_line_renders_with_parens_and_colon
    frame_with_file_but_no_line_renders_without_colon
    frame_with_no_file_renders_bare
    frame_with_no_function_renders_unknown
    to_debug_info_flattens_chain
    to_debug_info_outermost_has_no_caused_by_prefix

test result: FAILED. 15 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
