*** sererr/src/lib.rs:309:34: replace == with != in to_debug_info

*** mutation diff:
--- sererr/src/lib.rs
+++ replace == with != in to_debug_info
@@ -301,17 +301,17 @@
         return DebugInfo::default();
     }
 
     let mut stack_entries: Vec<String> = Vec::new();
     let mut detail_parts: Vec<String> = Vec::new();
 
     for (idx, entry) in chain.iter().rev().enumerate() {
         let header = format!("{}: {}", entry.r#type, entry.message);
-        detail_parts.push(if idx == 0 {
+        detail_parts.push(if idx != /* ~ changed by cargo-mutants ~ */ 0 {
             header.clone()
         } else {
             format!("Caused by: {header}")
         });
 
         if idx == 0 {
             stack_entries.push(header);
         } else {

---- to_debug_info_single_entry_has_no_caused_by stdout ----

thread 'to_debug_info_single_entry_has_no_caused_by' (3599561) panicked at sererr/tests/capture_test.rs:338:5:
assertion failed: !di.detail.contains("Caused by")

---- to_debug_info_outermost_has_no_caused_by_prefix stdout ----

thread 'to_debug_info_outermost_has_no_caused_by_prefix' (3599560) panicked at sererr/tests/capture_test.rs:307:5:
assertion failed: first_detail.starts_with("OuterT:")

failures:
    to_debug_info_outermost_has_no_caused_by_prefix
    to_debug_info_single_entry_has_no_caused_by

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
