*** sererr/src/lib.rs:315:16: replace == with != in to_debug_info

*** mutation diff:
--- sererr/src/lib.rs
+++ replace == with != in to_debug_info
@@ -307,17 +307,17 @@
     for (idx, entry) in chain.iter().rev().enumerate() {
         let header = format!("{}: {}", entry.r#type, entry.message);
         detail_parts.push(if idx == 0 {
             header.clone()
         } else {
             format!("Caused by: {header}")
         });
 
-        if idx == 0 {
+        if idx != /* ~ changed by cargo-mutants ~ */ 0 {
             stack_entries.push(header);
         } else {
             stack_entries.push(format!("Caused by: {header}"));
         }
 
         for frame in &entry.frames {
             stack_entries.push(format_frame_line(frame));
         }

---- to_debug_info_outermost_has_no_caused_by_prefix stdout ----

thread 'to_debug_info_outermost_has_no_caused_by_prefix' (3599874) panicked at sererr/tests/capture_test.rs:315:5:
stack_entries[0] should be outermost header; got "Caused by: OuterT: the_outer_msg"

failures:
    to_debug_info_outermost_has_no_caused_by_prefix

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
