*** sererr/src/lib.rs:333:5: replace format_frame_line -> String with "xyzzy".into()

*** mutation diff:
--- sererr/src/lib.rs
+++ replace format_frame_line -> String with "xyzzy".into()
@@ -325,22 +325,10 @@
 
     DebugInfo {
         stack_entries,
         detail: detail_parts.join("\n"),
     }
 }
 
 fn format_frame_line(frame: &StackFrame) -> String {
-    let location = if frame.file.is_empty() {
-        String::new()
-    } else if frame.line > 0 {
-        format!(" ({}:{})", frame.file, frame.line)
-    } else {
-        format!(" ({})", frame.file)
-    };
-    let function = if frame.function.is_empty() {
-        "<unknown>"
-    } else {
-        &frame.function
-    };
-    format!("  at {function}{location}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

---- frame_with_file_and_line_renders_with_parens_and_colon stdout ----

thread 'frame_with_file_and_line_renders_with_parens_and_colon' (3600500) panicked at sererr/tests/capture_test.rs:360:5:
expected '  at fn_a (src/x.rs:42)' in stack_entries; got ["T: m", "xyzzy"]

---- frame_with_file_but_no_line_renders_without_colon stdout ----

thread 'frame_with_file_but_no_line_renders_without_colon' (3600501) panicked at sererr/tests/capture_test.rs:383:5:
expected '  at fn_b (src/y.rs)' (no line); got ["T: m", "xyzzy"]

---- frame_with_no_file_renders_bare stdout ----

thread 'frame_with_no_file_renders_bare' (3600502) panicked at sererr/tests/capture_test.rs:407:5:
expected '  at fn_c' (no parens); got ["T: m", "xyzzy"]

failures:
    frame_with_file_and_line_renders_with_parens_and_colon
    frame_with_file_but_no_line_renders_without_colon
    frame_with_no_file_renders_bare
    frame_with_no_function_renders_unknown

test result: FAILED. 17 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
