*** sererr/src/lib.rs:335:26: replace > with == in format_frame_line

*** mutation diff:
--- sererr/src/lib.rs
+++ replace > with == in format_frame_line
@@ -327,17 +327,17 @@
         stack_entries,
         detail: detail_parts.join("\n"),
     }
 }
 
 fn format_frame_line(frame: &StackFrame) -> String {
     let location = if frame.file.is_empty() {
         String::new()
-    } else if frame.line > 0 {
+    } else if frame.line == /* ~ changed by cargo-mutants ~ */ 0 {
         format!(" ({}:{})", frame.file, frame.line)
     } else {
         format!(" ({})", frame.file)
     };
     let function = if frame.function.is_empty() {
         "<unknown>"
     } else {
         &frame.function

---- frame_with_file_and_line_renders_with_parens_and_colon stdout ----

thread 'frame_with_file_and_line_renders_with_parens_and_colon' (3600786) panicked at sererr/tests/capture_test.rs:360:5:
expected '  at fn_a (src/x.rs:42)' in stack_entries; got ["T: m", "  at fn_a (src/x.rs)"]

---- frame_with_file_but_no_line_renders_without_colon stdout ----

thread 'frame_with_file_but_no_line_renders_without_colon' (3600787) panicked at sererr/tests/capture_test.rs:383:5:
expected '  at fn_b (src/y.rs)' (no line); got ["T: m", "  at fn_b (src/y.rs:0)"]

---- frame_with_no_function_renders_unknown stdout ----

thread 'frame_with_no_function_renders_unknown' (3600789) panicked at sererr/tests/capture_test.rs:429:5:
expected unknown placeholder; got ["T: m", "  at <unknown> (src/z.rs)"]

failures:
    frame_with_file_and_line_renders_with_parens_and_colon
    frame_with_file_but_no_line_renders_without_colon
    frame_with_no_function_renders_unknown

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
