*** sererr/src/lib.rs:335:26: replace > with >= in format_frame_line

*** mutation diff:
--- sererr/src/lib.rs
+++ replace > with >= in format_frame_line
@@ -327,17 +327,17 @@
         stack_entries,
         detail: detail_parts.join("\n"),
     }
 }
 
 fn format_frame_line(frame: &StackFrame) -> String {
     let location = if frame.file.is_empty() {
         String::new()
-    } else if frame.line > 0 {
+    } else if frame.line >= /* ~ changed by cargo-mutants ~ */ 0 {
         format!(" ({}:{})", frame.file, frame.line)
     } else {
         format!(" ({})", frame.file)
     };
     let function = if frame.function.is_empty() {
         "<unknown>"
     } else {
         &frame.function

---- frame_with_file_but_no_line_renders_without_colon stdout ----

thread 'frame_with_file_but_no_line_renders_without_colon' (3601352) panicked at sererr/tests/capture_test.rs:383:5:
expected '  at fn_b (src/y.rs)' (no line); got ["T: m", "  at fn_b (src/y.rs:0)"]

failures:
    frame_with_file_but_no_line_renders_without_colon

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
